import os
import dotenv

from langchain_google_genai import GoogleGenerativeAI
from langchain_core.prompts import PromptTemplate

# завантаження апі ключа
dotenv.load_dotenv()
api_key = os.getenv("GEMINI_API_KEY")

# створити llm
llm = GoogleGenerativeAI(
    model='gemma-3-1b-it',
    api_key=api_key,
    temperature=0
)

# response = llm.invoke("hello")
# print(response)

# запити, prompt(підказка)

# Хто ти?
# Коротка інструкція/опис задачі або завдання(1-3 речення)
# Додаткова інформація(дані з файлу)
# Деталі і точні інструкції як діяти в різних ситуаціях
# Запит від користувача

# Приклад(інтерв'юер)

prompt = PromptTemplate.from_template("""
Ти -- підбадьорливий, ввічлий інтерв'юер.
Твоя задача допомгти користувача підготуватися до інтерв'ю. Задавай питання
різнії складності, але так щоб мотивувати користувача продовжувати співбесіду.
Користуйся порадами з документу

###ДОКУМЕНТ
{text}

###ІНСТРУКЦІЇ
1. Мотивуй користувача продовжувати спілкування
2. Якщо користувач дає некоректні відповіді то вкажи на проблеми та задай
наступне запитання легшого рівня
3. В кінці інтерв'ю дай загальний відгук

###ЗАПИТ ВІД КОРИСТУВАЧА
{user_query}
""")

# створення ланцюга
chain = prompt | llm    

# # використання
# response = chain.invoke(
#     {
#       "text": "документ",
#       "user_query": "Доброго дня"
#     }
# )

# # як це працює
# result = prompt.invoke(
#     {
#       "text": "документ",
#       "user_query": "Доброго дня"
#     }
# )
#
# response = llm.invoke(result)

# print(response)

# якщо ви надаєте просто інструкції то це називають Zero-Shot
# якщо ви надаєте приклади то це називають Few-Shot

# класифікатор коментарів до відео/фільму

# prompt = PromptTemplate.from_template("""
# Ти -- класифікатор коментарів до відео/фільму. Твоя задача віднести
# коментар до одного з типів: позитивний, негатовний та нейтральний.
#
# ### ПРИКЛАД
# КОМЕНТАР: класний фільм, обов'язково порекумендую знайомим
# ТИП: позитивний
#
# КОМЕНТАР: фільм настільки цікавий що аж заснув, спалось добре
# ТИП: негативний
#
# КОМЕНТАР: фільм цікавий але вдруге не піду та й рекосентувати теж не стану, на любителя
# ТИП: нейтральний
#
# КОМЕНТАР: {user_comments}
# ТИП:
# """)
#
# chain =  prompt | llm
#
# comment_type = chain.invoke(
#     {
#        "user_comments": "таке собі"
#     }
# )
#
# print(comment_type)


# chain of thoughts -- ланцюг думок

data = """
У магазині продали 12 коробок. У кожній коробці по 6 пляшок,
але в одній коробці не вистачало 2 пляшок.
Скільки всього пляшок було продано?
Дай коротку відповідь одним числом"""

# response = llm.invoke(data)
#
# print(response)

prompt = PromptTemplate.from_template("""
Ти -- бот для розв'язання логічних задач. Твоя задача надати логічний хід думок
для розв'язання певної задачі, після якого показати саму відповідь.

### ЗАДАЧА
{task}
""")

chain = prompt | llm

response = chain.invoke(
    {
       "task": data
    }
)

print(response)
